# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
# Изначальный код:

# list = [5,4,8,2,9,2]
# sp = []
# for i in range((len(list)+1)//2):
#    sp.append(list[i]*list[-1-i])
# print(sp)

# С помощью List Comprehension

# list = [5,4,8,2,9,2]
# sp = [list[i]*list[-1-i] for i in range((len(list)+1)//2)]
# print(sp)
# ------------------------------------------------------------------

# Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.
# Пример:
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

# Исходный код:

# n = int(input('Введите количество чисел: ')) 
# def num(n):
#     return[round((1 + 1 / x)**x, 2) for x in range (1, n + 1)]          
# print(num(n))
# print('Сумма чисел равна:',round(sum(num(n))))

# С помошью лямбд:

# n = int(input('Введите количество чисел: ')) 
# num = lambda n: [round((1 + 1 / x)**x, 2) for x in range (1, n + 1)]
# print(num(n))
# print('Сумма чисел равна:',round(sum(num(n))))

# ---------------------------------------------------

# Задайте список из вещественных чисел. Напишите программу, 
# которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# Изначальный код

# list = [5.2, 4.5, 8.3, 2.9, 9.02, 2.1]
# dr = []
# for i in list:
#    dr.append(round(i%1,2))
# print(max(dr) - min(dr))

# # С помощью List Comprehension
# list = [5.2, 4.5, 8.3, 2.9, 9.02, 2.1]
# dr = [round(i%1,2) for i in list]
# print(max(dr) - min(dr))